Rokasbarasa1/STM32-Quadcopter/src/main.c
/* Auto generated shit -----------------------------------------------*/
#include "main.h"

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
/* Actual functional code -----------------------------------------------*/

#include "../lib/printf/retarget.h"
#include "stdio.h"
#include "string.h"
#include "../lib/mpu6050/mpu6050.h"
#include "../lib/gy271_qmc5883l/gy271.h"
#include "../lib/bmp280/bmp280.h"
#include "../lib/bn357/bn357.h"
#include "../lib/utils/ned_coordinates/ned_coordinates.h"
#include "../lib/nrf24l01/nrf24l01.h"

#define RxBuf_SIZE 500
#define MainBuf_SIZE 550

/**
 * Pre-scaler: 1000
 * Counter period: 1000
 * Timer clock = 50,000,000/1000 = 50KHz
 * PWM Frequency = 50,000/1000 = 50Hz
 * Duty cycle = 1s/PWM Freq = 20ms
 *
 * For servo it needs to be from 0.5ms to 2.5ms at the most extremes.
 * These are the values to set to CCR
 * 0.5/20 * 1000(Counter period) = 25
 * 2.5/20 * 1000 = 125
 */
#define MAX_TIMER_VALUE 999

uint8_t gps_output_buffer[MainBuf_SIZE];
uint8_t receive_buffer[RxBuf_SIZE];

// Interrupt for uart 2 data received
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
    // make sure the dma is initialized before uart for this to work
    // and that dma is initialized after GPIO.

    // If the stm32 is restarted and while it is initializing dma the
    // data arrives from the uart it fucks up. So you have to restart it a few times

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 1);

    if (huart->Instance == USART2)
    {
        // printf("Interrupt UART 2\n");
        memcpy((uint8_t *)gps_output_buffer, receive_buffer, Size);
        // unsigned char gpsString[] = "dfdgfhdfdfhsdfh$GNGGA,,,N,,E,,,,,M,,M,,*7413.786016\ndasdasd";
        // bn357_parse_and_store(gpsString, Size);
        bn357_parse_and_store((unsigned char*)gps_output_buffer, Size);
        /* start the DMA again */
        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, (uint8_t *)receive_buffer, RxBuf_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}

// Interrupt for uart 2 when it crashes to restart it
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        printf("Error UART 2\n");
        HAL_UART_DeInit(&huart2);
        HAL_UART_Init(&huart2);

        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, receive_buffer, RxBuf_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}


// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2
const float hard_iron_correction[3] = {205.801249, -329.544434, -51.579693};
const float soft_iron_correction[3][3] = {{0.178946, 0.001568, -0.007812},
                                          {0.001568, 0.181964, 0.002300},
                                          {-0.007812, 0.002300, 0.186567}};

const float accelerometer_correction[3] = {0.008026, -0.038413, 1.149903};
const float gyro_correction[3] = {-2.371043, 2.884454, 0.648193};

const float refresh_rate_hz = 50;

// gps variables
volatile double longitude = 0.0;
volatile double latitude = 0.0;


float acceleration_data[] = {0, 0, 0};
float gyro_angular[] = {0, 0, 0};
float complementary_ratio = 0.02;
float gyro_degrees[] = {0, 0, 0};
float magnetometer_data[] = {0, 0, 0};

// bmp280 data
float pressure = 0.0;
float temperature = 0.0;
float altitude = 0.0;

float north_direction[] = {0, 0, 0};
float east_direction[] = {0, 0, 0};
float down_direction[] = {0, 0, 0};

float pitch = 0;
float roll = 0;
float yaw = 0;

// for nrf24 radio transmissions
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
uint8_t rx_data[32];

// handling loop timing
uint32_t loop_start_time = 0;
uint32_t loop_end_time = 0;
int16_t deltaLoopTime = 0;

// PWM pins
// PA8  - 1 TIM1
// PA11 - 4 TIM1
// PA0  - 1 TIM2
// PA1  - 2 TIM2

// UART pins
// PA2  UART2 tx GPS
// PA3  UART2 rx GPS
// PA10 UART1 rx FTDI
// PA9  UART1 tx FTDI

// I2C pins
// PB7  I2C1 SDA
// PB6  I2C1 SCL

// SPI pins
// PA5  SPI1 SCK
// PA6  SPI1 MISO
// PA7  SPI1 MOSI

// GPIO
// PC13 Internal LED
// PB5  SPI RADIO
// PB4  SPI RADIO
// PA12 LED

void init_STM32_peripherals();
void fix_mag_axis(float *magnetometer_data);
uint16_t setServoActivationPercent(float percent, uint16_t minValue, uint16_t maxValue);
void extract_request_values(char *request, uint8_t request_size, uint8_t *x, uint8_t *y);
double get_sensor_fusion_altitude(double gps_altitude, double barometer_altitude);
void init_sensors();
void init_loop_timer();
void check_calibrations();
void get_initial_position();
void handle_loop_timing();
void convert_angular_rotation_to_degrees();
void output_magnetometer_measurement();
void control_esc(uint8_t x, uint8_t y);

int main(void)
{
    init_STM32_peripherals();
    init_sensors();
    init_loop_timer();
    // check_calibrations();
    get_initial_position();

    // uint16_t new_value1 = setServoActivationPercent(100, 50, 150);

    // TIM1->CCR1 = new_value1;
    // TIM1->CCR4 = new_value1;
    // TIM2->CCR1 = new_value1;
    // TIM2->CCR2 = new_value1;

    // HAL_Delay(5000);
    // uint16_t new_value2 = setServoActivationPercent(0, 50, 150);

    // TIM1->CCR1 = new_value2;
    // TIM1->CCR4 = new_value2;
    // TIM2->CCR1 = new_value2;
    // TIM2->CCR2 = new_value2;

    // HAL_Delay(5000);

    while (1)
    {
        // for measuring time 
        // uint32_t start_point = HAL_GetTick();
        // uint32_t end_point = HAL_GetTick();
        // printf("Radio time: %d ms\n", end_point - start_point);
        // printf("New loop\n");

        // Read sensor data
        latitude = bn357_get_latitude_decimal_format();
        longitude = bn357_get_longitude_decimal_format();
        temperature = bmp280_get_temperature_celsius();

        // calculate the altitude using gps altitude and a bmp280 reference altitude
        // Reset the reference on bmp280 every time the gps gets updated
        // So the barometer keeps track in between the gps updates and does so with the 
        // origin of the precise altitude value from gps

        altitude = get_sensor_fusion_altitude(bn357_get_altitude_meters() ,(double)bmp280_get_height_meters_from_reference(bn357_get_status_up_to_date(1)));
        mpu6050_get_accelerometer_readings_gravity(acceleration_data);
        mpu6050_get_gyro_readings_dps(gyro_angular);
        gy271_magnetometer_readings_micro_teslas(magnetometer_data);
        fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050


        // Calculate using sensor data
        get_ned_coordinates(acceleration_data, magnetometer_data, north_direction, east_direction, down_direction);
        calculate_pitch_and_roll(acceleration_data, &roll, &pitch);
        calculate_yaw(magnetometer_data, &yaw);
        convert_angular_rotation_to_degrees();

