Rokasbarasa1/STM32-Quadcopter/src/main.c
        // // Joystick values, 50 is basically zero position
        uint8_t x = 50;
        uint8_t y = 50;

        if(nrf24_data_available(1)){
            nrf24_receive(rx_data);
            extract_request_values((char*) rx_data, strlen((char*) rx_data), &x, &y);
            printf("Dat %d %d\n", x, y);
        }

        control_esc(x, y);
        // output_magnetometer_measurement();

        // Print out for debugging
        printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("NORTH, %6.2f, %6.2f, %6.2f, ", north_direction[0], north_direction[1], north_direction[2]);
        // printf("TEMP %6.5f, ", temperature);
        printf("ALT %6.2f, ", altitude);
        printf("GPS %f, %f", longitude, latitude);
        printf("\n");

        handle_loop_timing();
    }
}

void init_STM32_peripherals(){
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 0);

    HAL_Delay(1);
    MX_DMA_Init(); // This has to be before the uart inits, otherwise dma interrupts dont work
    MX_I2C1_Init();
    MX_SPI1_Init();
    MX_TIM1_Init();
    MX_TIM2_Init();
    HAL_Delay(1);
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    RetargetInit(&huart1);

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);

    // HAL_UART_RegisterCallback(&huart2, HAL_UART_ERROR_CB_ID, HAL_UART_ErrorCallback);

    HAL_UARTEx_ReceiveToIdle_DMA(&huart2, receive_buffer, RxBuf_SIZE);
    __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
}

void init_sensors(){
    printf("-----------------------------INITIALIZING MODULES...\n");

    uint8_t mpu6050 = init_mpu6050(&hi2c1, 1, accelerometer_correction, gyro_correction);
    uint8_t gy271 = init_gy271(&hi2c1, 1, hard_iron_correction, soft_iron_correction);
    uint8_t bmp280 = init_bmp280(&hi2c1);
    uint8_t bn357 = init_bn357(&huart2, 0);
    uint8_t nrf24 = init_nrf24(&hspi1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && gy271 && bmp280 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
    }

    // Continue initializing
    nrf24_rx_mode(tx_address, 10);
}

void init_loop_timer(){
    loop_start_time = HAL_GetTick();
}

void check_calibrations(){
    // Checking errors of mpu6050
    find_accelerometer_error(1000);
    find_gyro_error(300);
}

void get_initial_position(){
    // Find the initial position in degrees and apply it to the gyro measurement integral
    // This will tell the robot which way to go to get the actual upward
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    gy271_magnetometer_readings_micro_teslas(magnetometer_data);
    fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050

    calculate_pitch_and_roll(acceleration_data, &roll, &pitch);
    calculate_yaw(magnetometer_data, &yaw);

    gyro_degrees[0] = -roll;
    gyro_degrees[1] = -pitch;
    gyro_degrees[2] = -yaw;
    printf("Initial location x: %.2f y: %.2f, z: %.2f\n", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
}

void handle_loop_timing(){
    loop_end_time = HAL_GetTick();
    deltaLoopTime = loop_end_time - loop_start_time;
    // printf("Tim: %d ms\n", deltaLoopTime);
    if (deltaLoopTime < (1000 / refresh_rate_hz))
    {
        HAL_Delay((1000 / refresh_rate_hz) - deltaLoopTime);
    }
    loop_start_time = HAL_GetTick();
}

void convert_angular_rotation_to_degrees(){
    // Convert angular velocity to actual degrees that it moved and add it to the integral (dead reckoning not PID)
    gyro_degrees[0] += (gyro_angular[0] * (1.0 / refresh_rate_hz));
    gyro_degrees[1] += (gyro_angular[1] * (1.0 / refresh_rate_hz));
    gyro_degrees[2] += (gyro_angular[2] * (1.0 / refresh_rate_hz));

    // Apply complimentary filter
    gyro_degrees[0] = (gyro_degrees[0] * (1.0 - complementary_ratio)) + (complementary_ratio * (-roll));
    gyro_degrees[1] = (gyro_degrees[1] * (1.0 - complementary_ratio)) + (complementary_ratio * (-pitch));
    gyro_degrees[2] = (gyro_degrees[2] * (1.0 - complementary_ratio)) + (complementary_ratio * (-yaw));
}

void output_magnetometer_measurement(){
    // For calibrating magnetometer
    printf(
        "%f,%f,%f\n",
        magnetometer_data[0],
        magnetometer_data[1],
        magnetometer_data[2]
    );
}

void control_esc(uint8_t x, uint8_t y){
    if(x<=50){
        x = 0;
    }else{
        x -= 50;
        x *= 2;
    }
    // printf("value: %d\n",x);
    uint16_t value = setServoActivationPercent(x, 50, 150);
    TIM1->CCR1 = value;
    TIM1->CCR4 = value;
    TIM2->CCR1 = value;
    TIM2->CCR2 = value;
}
// 0.5ms to 2ms = range is 1.5
// 0.5 is 2.5%  and is 25
// 2   is 10%   amd is 100
// 100 - 25 = 75

// default min and max is 25 and 75
uint16_t setServoActivationPercent(float percent, uint16_t minValue, uint16_t maxValue)
{
    float percentProportion = percent / 100.0;
    return percentProportion * (maxValue - minValue) + minValue;
}

double get_sensor_fusion_altitude(double gps_altitude, double barometer_altitude){
    return gps_altitude + barometer_altitude;
}

void extract_request_values(char *request, uint8_t request_size, uint8_t *x, uint8_t *y)
{
    uint8_t x_index = 1;
    uint8_t x_end_index = 0;

    for (uint8_t i = 1; i < request_size; i++)
    {
        if (request[i] == '/')
        {
            x_end_index = i;
            break;
        }
    }

    uint8_t y_index = x_end_index + 1;
    uint8_t y_end_index = request_size - 1;

    uint8_t x_length = x_end_index - x_index;
    char x_substring[x_length + 1];
    strncpy(x_substring, &request[x_index], x_length);
    x_substring[x_length] = '\0';
    *x = atoi(x_substring);

    uint8_t y_length = y_end_index - y_index + 1;
    char y_substring[y_length + 1];
    strncpy(y_substring, &request[y_index], y_length);
    y_substring[y_length] = '\0';
    *y = atoi(y_substring);
}

void fix_mag_axis(float *magnetometer_data)
{
    float temp = 0.0;
    temp = magnetometer_data[0];
    // y is x
    magnetometer_data[0] = magnetometer_data[1];
    // x is -y
    magnetometer_data[1] = -temp;
}

/* Auto generated shit again-----------------------------------------------*/

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

